## SQL Interview question

**1.What is DBMS?**

- A DBMS is s/w that helps to store,organize and mange data.
- Data store-> Files ,Tables and hireachircal format.
- General tool to manage data.
- e.g -Microsoft Access,dBase.

**2.What is RDBMS?**

- A RDBMS is type of DBMS--To store data in tables(row and columns) and user relations(relationship) between them.
- use SQL (Structure Query Language) for queries.
- Support :Constraint --> primary key,foreign key,Unique for data integrity.
- RDMS :DBMS with tables and relationships.
- e.g -MySQL ,Oracle.

**3.What is database?**

- A database is organized collection of data that stored.So it can be easily access, manged and updated.

Features::
- 1.Store -> large amount of data.
- 2.Data can be retrieved quickly (search,filters) using queries.
- 3.support ->updating,deleting and inserting data.
- 4.Maintain -Consistency and security.
- 5.Can be used by multiple user at same time.

Types ::
- 1.RDBMS -Store in tables(MYSQL,Oracle,PostgreSQL.
- 2.NoSQL DB -Store in unstructured/semi-structure(MongoDB).
- 3.Cloud DB -Manged online.(AWS, Google cloud SQL).

**4.what is SQL?**

- SQL stands for Structure Query language.
- SQL is used to communicate to database to perform different kind of operation.
- We can send SQL commands using client s/w.

 two types client:
- 1.Graphical mode(GUI)
- 2.CLI(Command line interface)

e.g ::
Oracle DB ::
 - SQLDeveloper(GUI).
 - SQL Plus(CLI).

MYSQL DB ::
 - MYSQLWorkbech(GUI)
 - MYSQL CommandLinetool(CLI)

**5.What is client?**
- The client is program, tool or application that send request(SQL queries) to the DB.
- client not store the data --only communicates with server.

**6.what is server in SQL**
- The server is database system( like MYSQL server,PostgreSQL server,Oracle DB).
- It stores the data,process--Queries and returns results to the client.
- e.g ::
- Client -->send SQL Query-->select * from users
- Server -->recevies-->process-->fetch data from storage.
- Server -->send result back to client.

**SQL Language**

In [ ]:

 1.DDL(Data Defination language)
 - CREATE ,ALTER,DROP,TRUNCATE,RENAME

 2.DML(Data Manipulation language)
 - INSERT,UPADTE,DELETE

3.DRL/DQL(Data Retrieval Language/Data Query Language)
  - SELECT
    
 4.TCL(Transaction Control Language)
  - COMMIT,ROLLBACK,SAVE POINT
    
 5.DCL(Data Control Language)
  - GRANT,REVOKE

**Create Database/Schema**

In [ ]:
CREATE DATABASE <<DATABASE NAME>>;
 -creating database

DROP DATABASE <<DATABASE NAME>>;
 -deleting database

**CREATE/INSERT IN tables**

In [ ]:

-Use database first
 USE <<DATABASE NAME>>;  //ONLY ONCE NEED TO USE THIS COMMANDS.
    
CREATE TABLE <<TABLE NAME>>
    (COLUMN 1 DATATYPE,COL2 DATATYPE);
-e.g :: CREATE TABLE STUDENT(SNO INT(10) ,SNAME VARCHAR(50),MARKS INT(30);   //CREATE STUDENT TABLE

DESCIBE STUDENT; //SHOW ALL ROW AND COLUMN OF TABLE.

//APPROCH :1
INSERT INTO <<TABLE NAME>>
    VALUES (101,'ANNU',80);   //INSERT FIRST STUDENT IN TABLE.

//APPROCH :2
INSERT INTO <<TABLE NAME>>(SNO,SNAME,MARKS)
        VALUES (101,'ANNU',80);  

//APPROCH:3
INSERT INTO <<TABLE NAME>>
        VALUES (101,'ANNU',null);

**SELECT command in tables**

In [ ]:
select and retrive data from table.

SELECT * FROM <<TABLE NAME>>;

-ALIAS 
    INSTEAD FULL NAME OF COLUMN NAME USE ALIAS.
-SELECT SNO NO,SNAME NME,MARKS MK FROM <<TABLE NAME>>;

In [ ]:
**SQL Numeric DATA TYPES***
INT / INTEGER	
SMALLINT	
BIGINT
DECIMAL(p,s) (DECIMAL(10,2))	Depends on precision
BIT	
FLOAT(n)

In [ ]:
**SQL TEXT DATA TYPES***
- CHAR()
- VARCHAR()
- BLOB
- MEDIUMTEXT
- MEDIUMBLOB
- LONGTEXT
- LONGBLOB

**SQL DATE AND TIME***
- DATE -------- YYYY-MM-DD
- DATETIME -------- YYYY-MM-DD HH:MM:SS
- TIMESTAMP ---------- YYYYMMDDHHMMSS
- TIME ------------HH:MM:SS

**WHERE CLAUSE(Filteing records based on conditions )**

- where clause is used to filter rows in table based on condition.
- without WHERE --query affect/returns all rows.
- with where -- only rows matching the condition are returned or updated.

In [ ]:
-SELECT * FROM STUDENT WHERE MARKS>90;

**DISTINCT (Filting records based on conditions )**

- DISINCT keyword is used in SQL remove duplicates values from result set.
- It ensure that only unique values are returned.

In [ ]:
- select DISITINCT MARKS from student

**Logical operates(AND ,OR, NOT)**
- Using inside the WHERE clause to combine conditions.

In [ ]:
-  1.AND
-  Return rows --Only if all conditions are true.
   e.g:
   
-  select * from student where marks>90 AND name='ANNU';

-  2.OR
-  Return rows --Only if one conditions are true.
  e.g:

-  select * from student where marks>80 OR name='ANNU';

- 3.NOT
- Reverse the condition(return row where the condition is FALSE)
  e.g:
  
-  select * from student where NOT name='ANNU';

**What is BETWEEN?**

- the BETWEEN operator is used SQL to filters result with in a given range.
- Works with numbers, dates, and even text.
- Works well with AND, OR, and NOT.

**What is NOT BETWEEN?**

- The NOT BETWEEN operator is used to filter values outside a given range.
- NOT BETWEEN → outside the range (exclusive of boundaries).

In [ ]:
e.g -
SELECT first_name, salary
FROM employees
WHERE salary BETWEEN 40000 AND 60000;
----
WHERE salary NOT BETWEEN 40000 AND 60000;

**What is IN?**

- used to check if value matchs any value in a list.
- it's shorter way to writing multiple OR conditions.

**What is NOT IN?**
- used to excludes specific values in a list.

In [ ]:
e.g -
SELECT first_name, dept_id
FROM employees
WHERE dept_id IN (1, 3, 5);   //with values ,string and subqurey.
WHERE job_id IN ('HR', 'IT', 'FIN');
WHERE dept_id IN (
    SELECT dept_id FROM departments WHERE location_id = 1001
);

**What is LIKE?**

- LIKE operator is used in SQL to search for pattern in column's value.
- works with text (VARCHAR,CHAR).
- Often used in the WHERE clause.

It uses wildcards ::
- % :matches zero or more characters.
- _ :matches exactly one character.

In [ ]:
e.g ::
SELECT first_name
FROM employees
WHERE first_name LIKE 'A%';  //start with A
WHERE first_name LIKE '%A'; //Ends with A
WHERE first_name LIKE '%A%'; //Contains A
WHERE first_name LIKE 'e_';  //after only one character

WHERE first_name NOT LIKE '%A';

**DDL Commands**

**1.DDL(Data Definition Language)**

 **CREATE**
 
The CREATE statement is used to create databases, tables, views, indexes, or users in SQL.

CREATE DATABASE → make a new database

CREATE TABLE → make a new table

CREATE VIEW → make a virtual table from a query

CREATE INDEX → speed up searches

In [ ]:
e.g-
CREATE TABLE STUDENT (
    emp_id INT PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),   
);


 **ALTER**
 
- Adding a new column
- dropping a existing column.
- modifying the existing column (increase/decrease size of column,change data type of column).
- renaming a column.
- Add or drop constraints

In [ ]:
e.g -
    ALTER TABLE STUDENT
    ADD GRADE VARCHAR (20);  //adding column

In [ ]:
e.g -
    ALTER TABLE STUDENT
    DROP GRADE VARCHAR (20); //droping column

In [ ]:
e.g -
    ALTER TABLE STUDENT
    MODIFY COLUMN SNAME VARCHAR (20)); //MODIFY column

In [ ]:
e.g -
    ALTER TABLE STUDENT
    RENAME COLUMN SNAME TO STUDENT_NAME; //Rename column


 **DROP**
 
- used to permanently delete a database,table ,view or index.
- once dropped data are gone.
- DROP removes the entire table structure + data.

In [ ]:
e.g :
DROP TABLE employees;
DROP DATABASE HR_DB;
DROP VIEW high_salary_emps;


 **DELETE**
 
- used to remove rows(data) from table.
- we can delete all rows or only specific rows using a WHERE clause.
-

In [ ]:
e.g-
DELETE FROM employees WHERE dept_id = 3;
DELETE FROM employees;

ROLLBACK;

In [ ]:
Difference: 
DELETE vs TRUNCATE vs DROP
Command	    Removes	                      Keeps Table Structure	   Rollback Possible
DELETE	   Specific rows (with WHERE)   	✅ Yes	                  ✅ Yes
TRUNCATE	All rows (faster)            	✅ Yes                    ❌ No (depends on DB)
DROP	     Whole table (structure + data)	❌ No                     ❌ No


 **TRUNCATE**
 
- used to remove permenatly rows(data) from table.

In [ ]:
e.g-
TRUNCATE TABLE employees;


 **RENAME**
 
- used to change the name of Table or Column(depending on db system user is using).
- RENAME support in Oracle,MySQL,PostgreSQL,SQL server

In [ ]:
e.g -
alter table student
rename column SNAME To student_name;

alter table student
rename To students;

 **Built-in Function in SQL**

Mysql function
- 1.String function -Operate on string data types.
- 2.Numberic function -Operate on Numberic data types.
- 3.Date function -Operate on Date data types.
- 4.Aggeragate function -Operate on all of the data types and produce summarized result sets.

In [ ]:
 **String function**
 - 1.UPPER() :: Convert to Uppercase letter.
 - 2.LOWER() :: Convert to Lowercase letter.
     e.g-
    select UPPER('smith');
    select UPPER(FirstName) from students;
    select LOWER('RADHA');
    select LOWER(FirstName) from students;


 - 3.LENGTH()  ::return length of string 
    select Length('RADHA');

 - 4.TRIM() ::Remove the specified characters from both sides.
    select TRIM('   zzebra   ');
    select TRIM('z' from 'zebra');

 - 5.INSRT() :: Return position of character within a string.
    Select instr('Nike' ,'e');

 - 6.SUBSTR()/SUBSTRING() :: return substring of the string.
    select substr('ORACLE',2,3);
    select substring('ORACLE',2,4);

  - 7.CONCAT() ::to join two string.
    select concat(name,gender),* as namegender from student;

In [ ]:
 **Numeric function**
- 1. select abs(-40) :: Absolute value of number.return +ve value.
- 2. select SQRT(25) :: square root of number.
- 3. Select MOD(10,3)
- 4. select POW(10,3) -power of number;
- 5. select truncate(40.1234,2) ::Truncating number --
- 6. select truncate(4768,-2)
- 7. select truncate(47687898998,-5)
- 8. SELECT GREATEST(100,20,1,3)
- 9. SELECT LEAST(100,20,1,3)

In [ ]:
 **Date function**
 
select curdate();  :: return current date
select current_date();

select current_time(); :: return curent time.
select curtime();

select now(); :: return current date + time
select sysdate(); 

select month("2019-05-19") :: return month
select day("2019-05-19") :: return day
select year("2019-05-19") :: return year
select monthname("2019-05-19") :: return monthName

In [ ]:
**Aggregate function**
- aggregate function are all about performing calculations on multiple rows of single column of a table and returing a single value.

select avg(salary) from employees
select max(salary) from employees
select min(salary) from employees
select count(*) from employees

 **GROUP BY**
 - the GROUP BY  clause records into summary rows.
 - GROUP BY returns one records for each group.
 - GROUP BY is typically also involves aggregate function :: Count,MAX,MIN,SUM,AVG etc.
 - GROUP BY can group by one or more column.
 - grouping result from a table.

In [ ]:
-e.g ::
select department,sum(salary) from employees
group by department

select department,AVG(salary) from employees
group by department

select department,MAX(salary) from employees
group by department
select department,MIN(salary) from employees
group by department
select department,count(*)from employees
group by department

 **Having Clause**
 - Having clause is used to filter the output from group by.

    where --->Group By---->Having

In [ ]:
select department,sum(salary) from employees
group by department
having sum(salary)>227000.00

 **ORDER BY Clause**
 - order by clause is used to arrange row in a table(Ascending or descending order).
 -  where --->Group By---->Having --->Order By

In [ ]:
Select (col_name)
FROM (table_name)
WHERE (condition)
GROUP BY (col_name)
HAVING (condition)
ORDER BY (col_name)

select * from employees
order by  salary

select * from employees
order by  salary DESC

**Set Operators**

- UNION ::Remove duplicates.

- -UNION ALL::include duplicates faster performance.

  Limitation:::
- the UNION operator is used to combine the result set of two or more SELECT statenment.
- Each SELECT statement within UNION must have the same number of columns.
- the Columns must also have similar data types.
- the columns in each SELECT statement must also be in the same order.

In [ ]:
Select emp_id from A UNION 
    (select emp_id from B)

Select emp_id from A UNION ALL
    (select emp_id from B)

**SQL JOINS**

- joins help retrieving data from two or more database tables.
- the tables are mutually related using primary and foregin keys

   - 1.Equal Join/Inner Join/Simple join
   - 2.Right Join
   - 3.Left Join
   - 4.Full Join
   - 5.Self Join

In [ ]:
INNER JOIN ::  Returns only matching records from table1 and table2
e.g-
    SELECT * from A as a
    INNER JOIN B as b on
    a.emp_id =b.emp_id

In [ ]:
LEFT JOIN ::  Returns unmatched records from Left table1 and matching from table2.
matched records 
    e.g-
    SELECT * from A as a
    LEFT JOIN B as b on
    a.emp_id =b.emp_id

In [ ]:
RIGHT JOIN ::  Returns matching from table1 and unmatched records from RIGHT table2  
matched records 
    e.g-
    SELECT * from A as a
    RIGHT JOIN B as b on
    a.emp_id =b.emp_id

In [ ]:
FULL JOIN :: Retrun matching records from both table1,table2 + unmatched records table1(left) +unmatched records table2(Right)
e.g-
e.g-
    SELECT * from A as a
    FULL JOIN B as b on
    a.emp_id =b.emp_id

**SQL Subqueries**

In [ ]:
**SQL Subqueries**
- Sub Query is a Query within a Query.
- subQuery contain 2 parts ::
    1. Outer Query
    2. Inner Query

- The output of inner query is become input of outer query.

    Two types of sub queries ::
    1. single row sub query <=,>=,!=
    2.Multi row sub query  :: IN,ANY,ALL

**Intergrity Constraints**

In [ ]:
**Intergrity Constraints**
 - SQL constraints are used to specify rules for data in a table.
 - Constraints can be specified when the table is created with the CREATE TABLE statement,or After the table is created with the ALTER TABLE statement.

 SQL Constraints ::
 - NOT NULL :: ensure that a column cannot have NULL value.
 - UNIQUE :: ensure that all values in column are different.
 - PRIMARY KEY :: A combination of NOT NULL and UNIQUE.Uniquely identifies each row in a table.
 - Foreign key -Uniquely identifies a row/record in another table.
 - CHECK :: Ensure that all values in column satisfies a specific condition.
 - DEFAULT :: Sets a default value for a column when no value is specified.

In [ ]:
**NOT NULL**
    - This is constraint will not accpet NULL values into the column.
    - You can apply NOT NULL on any number of columns.

In [ ]:
**UNIQUE **
    - This is will not accept duplicates values.
    - This costraint can apply on both column and table level.
    -** UNIQUE constraint column can accpet multiple NULLS.



    - Column level
        -Create table( sno int(10) UNIQUE,
                      sname varchar(50),
                      marks int(10));


    - Table level
        -Create table( sno int(10),
                      sname varchar(50),
                      marks int(10)
                    UNIQUE(sno));

In [ ]:
**PRIMARY KEY **
    - Combination of UNIQUE +NOT NULL
    - primary key column will not allow duplicate values and also not null values.
    - primary key constraint create column level as well as table level.

    -we can create primary key on combination of two columns called composite primary key.
    Composite key can be applied at table level.

e.g-
create table students(
sno int (10) ,
sanme varchar(30),
marks int (10),
primary key(sno)
);

In [ ]:
**Foregin KEY **
      - a FOREIGN KEY is a key used to link two tables together.
      - a FOREIGN KEY is field (or collection of fields) in one table that refers to the PRIMARY KEY in another table.
      - the table containing the foregin key is called the child table,
        and the table containing the candidate key is called the parent table.

e.g -

create table course(
cno int (10) ,
coursename varchar(30),
price int(30),
sno int (10),
foreign key (sno) references students(sno)
);

In [ ]:
 **IMP point ::Foregin KEY**
 1- when you insert a record in to child table,the column will be refred in parent table.
 2- If you try remove parent table record directly without deleting records from child table.
 3- First,delete dependent records from child thable ,then delete record from parent table.
 
  4- ON DELETE CASCADE::
  - IF you delete record from Parent table directly, It will be removed and corressponding records will be also in Child table
e.g-
create table course(
cno int (10) ,
coursename varchar(30),
price int(30),
sno int (10),
foreign key (sno) references students(sno) ON DELETE CASCADE
);

In [ ]:
**CHECK **
 - CHECK constraint is used for allowing to user to enter specific values into column.

e.g -
create table students(
sno int (10) ,
sanme varchar(30),
marks int (10) check(marks between 50 and 100),
primary key(sno)
);

e.g -
create table students(
sno int (10) ,
sanme varchar(30),
marks int (10) ,
city varchar(50),
primary key(sno)
);

In [ ]:
**Default **
    - The DEFAULT constraint is used to provide a default value for a column.
    - The Default value will be added to all new records,If no other value is specified.

e.g -
create table students(
sno int (10) ,
sanme varchar(30),
marks int (10),
created_date  datetime default now(),
primary key(sno)
);

-----
insert into students(sno,sanme,marks)
values
(101,'shyam',40),
(102,'kris',60);

**AUTO INCREMENT**

In [ ]:
 - Auto Increment is function that operates on numeric data types.
 - It automatically generates sequential numeric values every time that a records inserted into a table for field defined as AUTO INCREMENT.

e.g-
Create table sd

**LIMIT**

In [ ]:
- Limit is used to display limited Rows from a table.

e.g-
    SELECT * from students LIMIT 10;
range -
    SELECT * from students LIMIT 2,7;

**VIEWS**

In [ ]:
 - A views is a virtual table based on the result-set of an SQL statement.
 - A view contains rows and columns, Just like real table.
 - You can add SQL Functions,WHERE and JOIN statements to a view and present the data.

     e.g- 
    Create view dept as 
    Select dept_id,dept_name from departments

    drop view dept;

**INDEX**

In [ ]:
- Indexs are used to retrive data from the database very fast.
- The Users cannot see the indexes they are just used to speed up searched/Quries.

    e.g-
    book has page of index page.
    e.g-
    Create index dept_index on 
    departments(dept_id);

    drop index dept_index on departments

**TCL COMMANDS**

In [ ]:
COMMIT  ::
    - Saves all changes made by the transaction permanently in the database.

In [ ]:
ROLLBACK ::
    - Undoes changes made in the current transaction (before COMMIT).

In [ ]:
Why Important in QA?
COMMIT / ROLLBACK helps test data integrity.
Ensures you can test database transactions without corrupting test data

**JDBC**

In [ ]:
What is JDBC?
- JDBC (Java Database Connectivity) is a Java API that allows Java programs to connect to and interact with databases.
- It provides a standard way to execute SQL queries (SELECT, INSERT, UPDATE, DELETE) from Java code.

Why do we use JDBC in QA/Automation?
To validate test data directly in the database after running automation scripts.
For back-end testing (data migration, ETL, healthcare records validation).
Helps check if data entered via UI is stored correctly in DB.

IMP prequestite::
    1.Java(JDK)
    2.Eclipse
    3.MySQL JDBC Driver.::https://www.mysql.com/products/connector/

In [ ]:
e.g :: Setup Connection for mysql.
    package SQL;

import java.sql.Connection;
import java.sql.DriverManager;
import java.sql.ResultSet;
import java.sql.SQLException;
import java.sql.Statement;

public class sqlConnectionSetup {

	public static void main(String[] args) throws SQLException {
		// TODO Auto-generated method stub

		
		//1.Creating a connection ::
		Connection con =DriverManager.getConnection("jdbc:mysql://localhost:3306", "root","!QAZxsw2");
		
		//2.Create a Statement/Query
		Statement statement =con.createStatement();
		//my query
		String useQ= "USE students";  //Use database first

		String InsertQ= "INSERT INTO students VALUES ";
		String SelectQ= "SELECT * from Students";

		//3.execute statement/Query
		statement.execute(useQ);   //execute
		
		//Store data in ResultSet
		ResultSet set =statement.executeQuery(SelectQ);   //executeQuery
		while(set.next()) {
			int sid =set.getInt("sno");
			String sname =set.getString("sanme");
			int marks =set.getInt("marks");
			String date =set.getString("Created_date");
			
			System.out.println(sid  +"		"+sname +"		"+marks+ "		"+date);

		}
		
		
		//4.Close connection
		con.close();
		System.out.println("Query executed.....");
	}

}

**ODBC**

In [ ]:
**IMP presquites** 
 DOWNLOAD and INSTALL : https://www.mysql.com/products/connector/

In [ ]:
 **MySQL shell **
How to connect to MySQL DB using mySQL Shell
     
MySQL  SQL > \connect root@localhost:3306/students
Creating a session to 'root@localhost:3306/students'
Please provide the password for 'root@localhost:3306': ********
Save password for 'root@localhost:3306'? [Y]es/[N]o/Ne[v]er (default No): n
Fetching global names, object names from `students` for auto-completion... Press ^C to stop.
Your MySQL connection id is 29
Server version: 8.0.43 MySQL Community Server - GPL
Default schema set to `students`.

 MySQL  localhost:3306 ssl  students  SQL > show databases;
+--------------------+
| Database           |
+--------------------+
| hr_db              |
| information_schema |
| mysql              |
| performance_schema |
| students           |
| sys                |
+--------------------+
6 rows in set (0.0018 sec)
 MySQL  localhost:3306 ssl  students  SQL > use hr_db
Default schema set to `hr_db`.
Fetching global names, object names from `hr_db` for auto-completion... Press ^C to stop.
 MySQL  localhost:3306 ssl  hr_db  SQL > show tables
                                      -> ;
+-----------------+
| Tables_in_hr_db |
+-----------------+
| departments     |
| dept            |
| employees       |
| jobs            |
| salaries        |
| students        |
+-----------------+
6 rows in set (0.0027 sec)
 MySQL  localhost:3306 ssl  hr_db  SQL >

In [ ]:
 **MySQL window Commnad prompt **
How to connect to MySQL DB using window Commnad prompt
    
C:\Program Files\MySQL\MySQL Server 8.0\bin>mysql -u root -p
Enter password: ********
Welcome to the MySQL monitor.  Commands end with ; or \g.
Your MySQL connection id is 31
Server version: 8.0.43 MySQL Community Server - GPL

Copyright (c) 2000, 2025, Oracle and/or its affiliates.

Oracle is a registered trademark of Oracle Corporation and/or its
affiliates. Other names may be trademarks of their respective
owners.

Type 'help;' or '\h' for help. Type '\c' to clear the current input statement.

mysql> show databases;
+--------------------+
| Database           |
+--------------------+
| hr_db              |
| information_schema |
| mysql              |
| performance_schema |
| students           |
| sys                |
+--------------------+
6 rows in set (0.00 sec)